part of 'languages.dart';

Map<String, String> faIr = {
  'app_name': 'مانیتو',
  'try_again': 'تلاش مجدد',
  'home': 'خانه',
  'categories': 'دسته بندی ها',
  'cards': 'کارت ها',
  'report': 'گزارش',
  'month_balance': 'موجودی @month تا امروز',
  'toman': 'تومان',
  'dollar': 'دلار',
  'euro': 'یورو',
  'pound': 'پوند',
  'dirham': 'درهم',
  'lire': 'لیر',
  'unit': '@unit',
  'jalali': 'شمسی',
  'gregorian': 'میلادی',
  'expense': 'هزینه',
  'income': 'درآمد',
  'recent_transactions': 'تراکنش های اخیر',
  'transactions': 'تراکنش ها',
  'see_more': 'مشاهده همه',
  'empty_transaction_list': 'لیست تراکنش های شما خالی است',
  'empty_transaction_list_caption': 'برای افزودن تراکنش جدید روی (+) کلیک کنید',
  'empty_card_list': 'لیست کارت های شما خالی است',
  'empty_card_list_caption': 'برای افزودن کارت جدید روی (+) کلیک کنید',
  'add': 'افزودن',
  'card_title': 'عنوان کارت',
  'bank': 'بانک',
  'card_number': 'شماره کارت',
  'balance': 'موجودی',
  'expire_date': 'تاریخ انقضا',
  'add_card': 'افزودن کارت',
  'add_new_card': 'افزودن کارت جدید',
  'must_not_empty': 'این فیلد نباید خالی باشد',
  'invalid_card_number': 'شماره کارت نامعتبر است',
  'create_account': 'ساخت حساب کاربری',
  'login_account': 'ورود به حساب کاربری',
  'have_account': 'حساب کاربری دارید؟ ',
  'have_not_account': 'حساب کاربری ندارید؟ ',
  'login': 'ورود',
  'register': 'ثبت نام',
  'login_success': 'ورود با موفقیت انجام شد',
  'register_success': 'ثبت نام با موفقیت انجام شد',
  'login_error': 'ورود با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'credential_error': 'ورود با خطا مواجه شد\n لطفا اطلاعات وارد شده را بررسی '
      'کنید',
  'register_error': 'ثبت نام با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'username': 'نام کاربری',
  'email': 'ایمیل',
  'password': 'رمز عبور',
  'invalid_number': 'فقط عدد مجاز است',
  'invalid_email': 'ایمیل نامعتبر است',
  'email_already_in_use': 'ایمیل قبلا استفاده شده است',
  'short_password': 'رمز عبور باید حداقل شامل 6 کاراکتر باشد',
  'onboarding_title_1': 'پس انداز برای آینده!',
  'onboarding_subtitle_1': 'مانیتو شما را تشویق می کند تا پولتان را برای '
      'اهداف '
      'آینده، '
      'بحران‌ها و یا '
      'سرمایه‌گذاری‌ها پسانداز کنید',
  'onboarding_title_2': 'پیگیری هزینه و درآمد',
  'onboarding_subtitle_2': 'با مانیتو هزینه‌ها و '
      'درآمدهای روزانه خود را پیگیری کنید. شما می‌توانید تراکنش‌ها را '
      'دسته‌بندی کنید و درباره عادات مالی خود به دانش'
      ' بیافزایید.',
  'onboarding_title_3': 'آنالیز خرج و مخارج',
  'onboarding_subtitle_3': 'شما می‌توانید مناطقی که بیش از حد هزینه می‌کنید را '
      'شناسایی کنید و تصمیم‌گیری‌های آگاهانه‌تری برای '
      'بهبود وضعیت مالی خود انجام دهید.',
  'bank_not_found': 'بانک مورد نظر پیدا نشد',
  'not_entered': 'وارد نشده',
  'load_cards_error': 'بارگیری کارت‌ها با خطا مواجه شد\n لطفا دوباره امتحان '
      'کنید',
  'load_card_error': 'بارگیری کارت‌ با خطا مواجه شد\n لطفا دوباره امتحان '
      'کنید',
  'load_categories_error': 'بارگیری دسته بندی ها با خطا مواجه شد\n لطفا دوباره '
      'امتحان '
      'کنید',
  'load_category_error': 'بارگیری دسته بندی با خطا مواجه شد\n لطفا دوباره '
      'امتحان '
      'کنید',
  'profile': 'پروفایل',
  'logout': 'خروج از حساب کاربری',
  'sure_to_logout': 'آیا مطمئن هستید که از حساب کاربری خود خارج شوید؟',
  'edit_profile': 'ویرایش اطلاعات',
  'change_password': 'تغییر رمز عبور',
  'about_app': 'درباره مانیتو',
  'money_unit': 'واحد پولی',
  'date_type': 'نوع تاریخ',
  'add_category': 'افزودن دسته بندی',
  'choose_icon': 'انتخاب آیکون',
  'change_icon': 'تغییر آیکون',
  'category_title': 'عنوان دسته بندی',
  'category_type': 'نوع دسته بندی',
  'load_icons_error': 'بارگیری آیکون ها با خطا مواجه شد\n لطفا دوباره '
      'امتحان '
      'کنید',
  'add_category_success': 'دسته بندی با موفقیت ثبت شد',
  'add_card_success': 'کارت با موفقیت ثبت شد',
  'add_category_error': 'افزودن دسته بندی با خطا مواجه شد\n لطفا دوباره '
      'امتحان '
      'کنید',
  'add_card_error': 'افزودن کارت با خطا مواجه شد\n لطفا دوباره '
      'امتحان '
      'کنید',
  'add_transaction': 'افزودن تراکنش جدید',
  'transaction_title': 'عنوان تراکنش',
  'amount': 'مبلغ',
  'card': 'کارت',
  'category': 'دسته بندی',
  'transaction_date': 'تاریخ تراکنش',
  'description': 'توضیحات',
  'load_transactions_error': 'بارگیری تراکنش ها با خطا مواجه شد\n لطفا دوباره '
      'امتحان '
      'کنید',
  'select': 'انتخاب',
  'support': 'حمایت از مانیتو',
  'add_transaction_success': 'تراکنش با موفقیت ثبت شد',
  'add_transaction_error': 'افزودن تراکنش با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'delete_card_error': 'حذف کارت با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'delete_card_success': 'حذف کارت با موفقیت ثبت شد',
  'delete_card': 'آیا از حذف کارت بانکی مطمئن هستید؟ با حذف کارت بانکی تراکنش'
      ' های آن نیز حذف می‌شود',
  'confirm': 'تایید',
  'cancel': 'انصراف',
  'no_card_available': 'هیچ کارتی موجود نیست\n لطفا یک کارت جدید تعریف کنید',
  'no_category_available': 'هیچ دسته بندی موجود نیست\n لطفا یک دسته بندی جدید '
      'تعریف '
      'کنید',
  'edit_card': 'ویرایش کارت',
  'edit': 'ویرایش',
  'edit_card_success': 'کارت با موفقیت ویرایش شد',
  'edit_card_error': 'ویرایش کارت با خطا مواجه شد\n لطفا دوباره '
      'امتحان '
      'کنید',
  'all_transactions': 'همه تراکنش ها',
  'total_expense': 'جمع هزینه ها',
  'total_income': 'جمع درآمد ها',
  'delete_category_error': 'حذف دسته بندی با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'delete_category_success': 'حذف دسته بندی با موفقیت ثبت شد',
  'delete_category': 'آیا از حذف دسته بندی مطمئن هستید؟ با حذف دسته بندی تراکنش'
      ' های آن نیز حذف می‌شود',
  'edit_category': 'ویرایش دسته بندی',
  'edit_category_success': 'دسته بندی با موفقیت ویرایش شد',
  'edit_category_error': 'ویرایش دسته بندی با خطا مواجه شد\n لطفا دوباره '
      'امتحان '
      'کنید',
  'edit_transaction': 'ویرایش تراکنش',
  'edit_transaction_success': 'تراکنش با موفقیت ویرایش شد',
  'edit_transaction_error': 'ویرایش تراکنش با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'card_detail': 'جزئیات کارت',
  'category_detail': 'جزئیات دسته بندی',
  'transaction_detail': 'جزئیات تراکنش',
  'date': 'تاریخ',
  'transaction_type': 'نوع تراکنش',
  'delete_transaction_error': 'حذف تراکنش با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'delete_transaction_success': 'حذف تراکنش با موفقیت ثبت شد',
  'delete_transaction': 'آیا از حذف تراکنش مطمئن هستید؟',
  'card_transactions': 'تراکنش های کارت @card',
  'category_transactions': 'تراکنش های کارت @category',
  'excel_file_saved': 'فایل اکسل در @path ذخیره شد',
  'storage_access_error': 'دسترسی به پوشه ذخیره‌سازی ممکن نیست.',
  'permission_denied': 'دسترسی رد شد',
  'edit_profile_confirm': 'آیا از ویرایش اطلاعات خود مطمئن هستید؟\n با ویرایش'
      ' اطلاعات از حساب کاربری خارج می شوید',
  'edit_profile_success': 'اطلاعات شما با موفقیت ویرایش شد',
  'edit_profile_error': 'ویرایش اطلاعات با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'change_password_confirm': 'آیا از تغییر رمز عبور خود مطمئن هستید؟\n با تغییر'
      ' رمز عبور از حساب کاربری خارج می شوید',
  'change_password_success': 'رمز عبور شما با موفقیت ویرایش شد',
  'change_password_error': 'تغییر رمز عبور با خطا مواجه شد\n لطفا '
      'دوباره '
      'امتحان '
      'کنید',
  'submit': 'ثبت',
  'current_password': 'رمز عبور فعلی',
  'new_password': 'رمز عبور جدید',
  'repeat_new_password': 'تکرار رمز عبور جدید',
  'from_date': 'از تاریخ',
  'to_date': 'تا تاریخ',
  'filter': 'فیلتر',
  'remove_filter': 'حذف فیلتر',
  'validation_required': 'مقدار مورد نیاز از دست رفته است.',
  'validation_length_out_of_range': 'طول رمز عبور باید بین 8 تا 72 کاراکتر باشد.',
  'validation_invalid_email': 'ایمیل نامعتبر یا قبلاً استفاده شده است.',
  'about': 'مانیتو، یه اپلیکیشن مدیریت مالی شخصیه که کمک می‌کنه همیشه بدونید پول‌هاتون رو کجا خرج میکنید. این اپلیکیشن با طراحی ساده و کاربردی ساخته شده تا بدون نیاز به دانش حسابداری بتونید مخارج و درآمدهاتون رو به راحتی ثبت کنید. فقط کافیه هر هزینه یا درآمدی رو وارد کنید و مانیتو بقیه کارها رو براتون انجام می‌ده. دیگه لازم نیست آخر ماه بشینید حساب کنید که چقدر خرج کردید، چون با مانیتو همیشه تصویر دقیقی از وضعیت مالی‌تون خواهید داشت :)'
};
